Repository: arichazan/textselector
Catalog: Sources/GrabDab/Resources/*.lproj/Localizable.strings
Languages: de, it

# menu.captureText
source: Grab Text/Code
de: Text Erfassen
it: Cattura Testo

# menu.preferences
source: Preferences…
de: Einstellungen…
it: Preferenze…

# menu.quit
source: Quit GrabDab
de: GrabDab Beenden
it: Esci da GrabDab

# preferences.title
source: GrabDab Preferences
de: GrabDab Einstellungen
it: Preferenze GrabDab

# preferences.capture.header
source: Capture
de: Erfassung
it: Cattura

# preferences.startup.header
source: Startup
de: Start
it: Avvio

# preferences.advanced.header
source: Advanced
de: Erweitert
it: Avanzate

# preferences.globalHotkey
source: Global Hotkey
de: Globaler Hotkey
it: Scorciatoia Globale

# preferences.ocrLanguage
source: OCR Language
de: OCR-Sprache
it: Lingua OCR

# preferences.showToast
source: Show confirmation toast
de: Bestätigung anzeigen
it: Mostra conferma

# preferences.launchAtLogin
source: Launch GrabDab at login
de: GrabDab bei Anmeldung starten
it: Avvia GrabDab all'accesso

# preferences.latinOnlyMode
source: Latin-only mode (faster for English/European text)
de: Nur-Lateinisch-Modus (schneller für englischen/europäischen Text)
it: Modalità solo latino (più veloce per testo inglese/europeo)

# preferences.enableRefinePass
source: Enable language refinement
de: Sprachverfeinerung aktivieren
it: Abilita raffinamento linguistico

# preferences.minAcceptConfidence
source: Minimum confidence threshold
de: Minimaler Konfidenz-Schwellenwert
it: Soglia minima di confidenza

# preferences.reconsiderConfidence
source: Retry threshold for rotation
de: Wiederholungs-Schwellenwert für Rotation
it: Soglia di ripetizione per rotazione

# preferences.autoSave
source: Changes are saved automatically.
de: Änderungen werden automatisch gespeichert.
it: Le modifiche vengono salvate automaticamente.

# toast.copied
source: Copied to Clipboard
de: In Zwischenablage Kopiert
it: Copiato negli Appunti

# toast.qrCode
source: QR Code Copied to Clipboard
de: QR-Code In Zwischenablage Kopiert
it: Codice QR Copiato negli Appunti

# toast.barcode
source: Barcode Copied to Clipboard
de: Barcode In Zwischenablage Kopiert
it: Codice a Barre Copiato negli Appunti

# toast.failed
source: OCR Failed
de: OCR Fehlgeschlagen
it: OCR Fallito

# toast.noText
source: No Text Found
de: Kein Text Gefunden
it: Nessun Testo Trovato

# toast.permission
source: Screen Permission Required
de: Bildschirmberechtigung Erforderlich
it: Permesso Schermo Richiesto

# result.title
source: Capture Result
de: Erfassungsergebnis
it: Risultato Cattura

# result.text
source: Text
it: Testo

# result.qrCode
source: QR Code
it: Codice QR

# result.barcode
source: Barcode
it: Codice a Barre

# permission.title
source: GrabDab needs screen access
de: GrabDab benötigt Bildschirmzugriff
it: GrabDab necessita accesso allo schermo

# permission.message
source: To Capture Text/QR/Bar Code from your screen, GrabDab needs permission to record your screen. This permission can be granted in System Settings > Privacy & Security > Screen Recording.
de: Um Text von Ihrem Bildschirm zu erfassen, benötigt GrabDab die Berechtigung, Ihren Bildschirm aufzuzeichnen. Diese Berechtigung kann in Systemeinstellungen > Datenschutz & Sicherheit > Bildschirmaufzeichnung erteilt werden.
it: Per catturare testo dal tuo schermo, GrabDab necessita il permesso di registrare il tuo schermo. Questo permesso può essere concesso in Impostazioni di Sistema > Privacy e Sicurezza > Registrazione Schermo.

# permission.continue
source: Continue
de: Fortfahren
it: Continua

# permission.openSettings
source: Open System Settings
de: Systemeinstellungen Öffnen
it: Apri Impostazioni di Sistema

# error.generic
source: Something went wrong
de: Etwas ist schiefgelaufen
it: Qualcosa è andato storto

# error.noText
source: No text found in the selected area
de: Kein Text im ausgewählten Bereich gefunden
it: Nessun testo trovato nell'area selezionata

# error.ocrFailed
source: OCR processing failed
de: OCR-Verarbeitung fehlgeschlagen
it: Elaborazione OCR fallita

# error.imageCapture
source: Failed to capture screen image
de: Bildschirmaufnahme fehlgeschlagen
it: Cattura immagine schermo fallita

# error.permission
source: Screen recording permission is required
de: Bildschirmaufzeichnungsberechtigung erforderlich
it: Permesso di registrazione schermo richiesto

# error.tesseractInit
source: Tesseract initialization failed
de: Tesseract-Initialisierung fehlgeschlagen
it: Inizializzazione Tesseract fallita

# error.visionOCR
source: Vision OCR failed
de: Vision OCR fehlgeschlagen
it: Vision OCR fallito

# error.primaryAndFallback
source: Both primary and fallback OCR failed
de: Sowohl primäre als auch Fallback-OCR fehlgeschlagen
it: OCR primario e di backup entrambi falliti

# ocr.processing
source: Processing…
de: Verarbeitung…
it: Elaborazione…

# ocr.detectionType.text
source: Text
it: Testo

# ocr.detectionType.qrCode
source: QR Code
it: Codice QR

# ocr.detectionType.barcode
source: Barcode
it: Codice a Barre

# language.english
source: English
de: Englisch
it: Inglese

# language.chineseSimplified
source: Chinese (Simplified)
de: Chinesisch (Vereinfacht)
it: Cinese (Semplificato)

# language.chineseTraditional
source: Chinese (Traditional)
de: Chinesisch (Traditionell)
it: Cinese (Tradizionale)

# language.japanese
source: Japanese
de: Japanisch
it: Giapponese

# language.korean
source: Korean
de: Koreanisch
it: Coreano

# language.spanish
source: Spanish
de: Spanisch
it: Spagnolo

# language.french
source: French
de: Französisch
it: Francese

# language.german
source: German
de: Deutsch
it: Tedesco

# language.italian
source: Italian
de: Italienisch
it: Italiano

# language.portuguese
source: Portuguese
de: Portugiesisch
it: Portoghese

# language.russian
source: Russian
de: Russisch
it: Russo

# language.arabic
source: Arabic
de: Arabisch
it: Arabo

# accessibility.statusItem
source: GrabDab - Click to grab text/code from screen
de: GrabDab - Klicken Sie, um Text vom Bildschirm zu erfassen
it: GrabDab - Clicca per catturare testo dallo schermo

# accessibility.captureOverlay
source: Text/code grab overlay - drag to select area
de: Text-Erfassungsüberlagerung - ziehen Sie, um Bereich auszuwählen
it: Sovrapposizione cattura testo - trascina per selezionare area

# accessibility.hotkeyRecorder
source: Hotkey recorder - press keys to set shortcut
de: Hotkey-Rekorder - drücken Sie Tasten, um Verknüpfung festzulegen
it: Registratore scorciatoia - premi tasti per impostare scorciatoia

# status.ready
source: Ready to capture
de: Bereit zum Erfassen
it: Pronto per catturare

# status.capturing
source: Capturing…
de: Erfassung…
it: Cattura…

# status.processing
source: Processing image…
de: Bild wird verarbeitet…
it: Elaborazione immagine…

# status.complete
source: Capture complete
de: Erfassung abgeschlossen
it: Cattura completata

# hotkey.space
source: Space
de: Leertaste
it: Spazio

# hotkey.none
source: No hotkey set
de: Kein Hotkey festgelegt
it: Nessuna scorciatoia impostata

# debug.regionDetection
source: Found %d text regions
de: %d Textbereiche gefunden
it: %d regioni di testo trovate

# debug.lineProcessing
source: Processing line %d of %d
de: Verarbeitung von Zeile %d von %d
it: Elaborazione riga %d di %d

# debug.confidenceComparison
source: Latin: %.3f, CJK: %.3f, Chosen: %@
de: Lateinisch: %.3f, CJK: %.3f, Gewählt: %@
it: Latino: %.3f, CJK: %.3f, Scelto: %@

# debug.rotationRetry
source: Low confidence, trying rotation
de: Niedrige Konfidenz, versuche Rotation
it: Confidenza bassa, tentando rotazione

# debug.finalOutput
source: Final OCR output: %@
de: Finale OCR-Ausgabe: %@
it: Output OCR finale: %@

# preferences.feedback.header
source: Feedback
de: Rückmeldung
